# CouplerCoupledEndtreatment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerCoupledEndtreatment Property
ParameterTypeId Class See Also
---
"End Treatment 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerCoupledEndtreatment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerCoupledEndtreatment As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerCoupledEndtreatment {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace